import random
# Завдання 1
#
# Напишіть функцію, яка обчислює добуток елементів списку цілих.
# Список передається як параметр. Отриманий результат повертається із функції.
####################################################################################

# random_list_of_integers = []                                                        # генерация списка
# for i in range(10):
#     random_list_of_integers.append(random.randint(1, 10))
#
# print(random_list_of_integers)
#
#
# def mult_elements(some_list_of_integers):                                           # функция умножения целых
#     mult_of_numbers = 1
#     for i in some_list_of_integers:
#         mult_of_numbers *= i
#     return print(f"Multiplication of all numbers in the list = {mult_of_numbers}")
#
#
# mult_elements(random_list_of_integers)

####################################################################################
# Завдання 2
#
# Напишіть функцію для знаходження мінімуму у списку цілих.
# Список передається як параметр. Отриманий результат повертається із функції.
####################################################################################

# random_list_of_integers = []                                                        # генерация списка
# for i in range(10):
#     random_list_of_integers.append(random.randint(-10, 10))
#
# print(random_list_of_integers)
#
#
# def find_min(some_list_of_integers):                                                # функция нахождения минимального числа
#     return print(f"Minimum number from the list = {min(some_list_of_integers)}")
#
#
# find_min(random_list_of_integers)

####################################################################################
# Завдання 3
#
# Напишіть функцію, яка визначає кількість простих чисел у списку цілих.
# Список передається як параметр. Отриманий результат повертається із функції.
####################################################################################



####################################################################################
# Завдання 4
#
# Напишіть функцію, яка видаляє зі списку ціле задане число.
# З функції потрібно повернути кількість видаленних елементів.
# ###################################################################################



####################################################################################
# Завдання 5
#
# Напишіть функцію, яка отримує два списки як параметр і повертає список,
# що містить елементи обох списків.
####################################################################################



####################################################################################
# Завдання 6
#
# Напишіть функцію, яка обчислює ступінь кожного елемента списку цілих.
# Значення для ступеня передається як параметр, список також передається як параметр.
# Функція повертає новий список, який містить отримані результати.
# ###################################################################################



####################################################################################